Repository: Furry-Xiyi/TranslateUWP
Catalog: TranslatorApp/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# AppDisplayName
source: Translator App
zh_hans: 翻译器

# NavLookup
source: Lookup & Translate
zh_hans: 查词翻译

# NavTranslate
source: Translate
zh_hans: 互译

# NavFavorites
source: Favorites
zh_hans: 收藏

# GlobalSearchBox
source: Type a word…
zh_hans: 输入词汇…

# ValidationSavedSuccess
source: Validation succeeded and saved
zh_hans: 验证成功，已保存

# ValidationFailed
source: Validation failed, please check and try again
zh_hans: 验证失败，请核对后重试

# MaskValidating
source: Validating…
zh_hans: 正在验证…

source: Material applied
zh_hans: 材质切换已应用

# ThanksFeedback
source: Thanks for feedback (link placeholder)
zh_hans: 感谢反馈（链接位置已留）
